# Курс по 1С для преподавателей
# Занятия от 19.08.2023 (онлайн занятие просмотрено в записи)
# Решение практических задач

# Задача №1
print("Первая программ")

# Задача №2
print("Данная программ")
print("Cоздана при помощи языка Pyhon")